SAPMockWebServiceClient/SAPRequest.xml

<?xml version="1.0" encoding="utf-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xs="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
  <SOAP-ENV:Header>
    <WSCorIDSOAPHeader xmlns="http://www.wilytech.com/" CorID="F30CF22F0A50103D36AC8A63D3BC2075,1:1,0,1,hsapdev1dbs03|SAP Netweaver|CR9_J00_server0|WebServices|Client|urn_sap-com_document_sap_rfc_functionsz_mta_interface|Z_MTA_INTERFACE,2,AgAAALZIQgAAAAFGAAAAAQAAABFqYXZhLnV0aWwuSGFzaE1hcAAAAAJIQgAAAAJGAAAAAgAAABBqYXZhLmxhbmcuU3RyaW5nAApUeG5UcmFjZUlkSEIAAAADRQAAAAIAJEYzMDBBNTA0MEE1MDEwM0QzNkFDOEE2MzU5REUyOTIxNjA4NEhCAAAABEUAAAACAA9DYWxsZXJUaW1lc3RhbXBIQgAAAAVFAAAAAgANMTU4NDYyNTY3Njg0Nw=="/>
  </SOAP-ENV:Header>
  <SOAP-ENV:Body>
    <Z_MTA_INTERFACE xmlns="urn:sap-com:document:sap:rfc:functions">
      <Z_MTA_INTERFACE>
        <IM_ORDER>
          <UNIQUEID>cs_test_8Sv3sZrrUxRsBlZ4DYiyc40DqOj6pcYp4tsYydRmzmyBErqmvYeZ41190</UNIQUEID>
          <TRANTYP>SALES</TRANTYP>
          <NAME>Bhalchandra</NAME>
          <ADDR1>v</ADDR1>
          <ADDR2>Krishna</ADDR2>
          <CITY>D</CITY>
          <POSTCODE>400607</POSTCODE>
          <STATE>Maharashtra</STATE>
          <COUNTRY>IN</COUNTRY>
          <PHONE />
          <EMAIL>Bhalchandra.marathe@mastek.com</EMAIL>
          <PONO />
          <POURL>https://pay.stripe.com/receipts/acct_1EsrCuEEkpsxk3Hy/ch_1GLW5jEEkpsxk3Hy4kaFpCOL/rcpt_GtIhg9tMtXJ70ZSDQv77m5ZVzRQjosU</POURL>
          <GROSSAMOUNT />
          <FEE>4.93</FEE>
          <NETAMOUNT />
          <ERDAT>2020-03-11</ERDAT>
          <CURRENCY>GBP</CURRENCY>
          <PRODUCTS>
            <item xmlns="">
              <PRODNAME>Tidal Prediction Service</PRODNAME>
              <PRODDESC>Starcross - 2020/2021/2022 - HW &amp; LW, split AM &amp; PM (framed) - 1 month per page (VAT incl.)</PRODDESC>
              <QTY>1</QTY>
              <PRICE>162</PRICE>
            </item>
          </PRODUCTS>
        </IM_ORDER>
      </Z_MTA_INTERFACE>
    </Z_MTA_INTERFACE>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>